In [3]:
import numpy as np 
import pandas as pd

In [11]:
arr = np.arange(0,10)
arr

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [13]:
ser1 = arr.reshape(5,2)

In [15]:
df = pd.DataFrame(ser1,['a','b','c','d','e'],['w','x'])

In [16]:
df

   w  x
a  0  1
b  2  3
c  4  5
d  6  7
e  8  9

In [17]:
from numpy.random import randn

In [19]:
np.random.seed(101)

In [20]:
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [21]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [22]:
df >0

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [24]:
booldf = df>0

In [25]:
df[booldf]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [29]:
df['w']>0

a     True
b     True
c    False
d     True
e     True
Name: w, dtype: bool

In [52]:
result = df[df['w']>0]

In [33]:
df[df['z']<0]

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001

In [35]:
result

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [36]:
result['x']

a    0.628133
b   -0.319318
d   -0.758872
e    1.978757
Name: x, dtype: float64

In [37]:
df[df['w']>0]['x']

a    0.628133
b   -0.319318
d   -0.758872
e    1.978757
Name: x, dtype: float64

In [51]:
boolser = df['w']>0
result = df[boolser]
result[['x','y']]

          x         y
a  0.628133  0.907969
b -0.319318 -0.848077
d -0.758872 -0.933237
e  1.978757  2.605967

In [50]:
result

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [53]:
df[(df['w']>0) & (df['y']>1)]

          w         x         y         z
e  0.190794  1.978757  2.605967  0.683509

In [54]:
df[(df['w']>0) | (df['y']>1)]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [55]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [56]:
df.reset_index()

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [60]:
newind = 'CA NY TO DC OR '.split()

In [61]:
newind

['CA', 'NY', 'TO', 'DC', 'OR']

In [62]:
df['states'] = newind

In [63]:
df

          w         x         y         z states
a  2.706850  0.628133  0.907969  0.503826     CA
b  0.651118 -0.319318 -0.848077  0.605965     NY
c -2.018168  0.740122  0.528813 -0.589001     TO
d  0.188695 -0.758872 -0.933237  0.955057     DC
e  0.190794  1.978757  2.605967  0.683509     OR

In [64]:
newind2 = 'IND BRA USA GER FRA'.split()

In [65]:
df['country'] = newind2

In [66]:
df

          w         x         y         z states country
a  2.706850  0.628133  0.907969  0.503826     CA     IND
b  0.651118 -0.319318 -0.848077  0.605965     NY     BRA
c -2.018168  0.740122  0.528813 -0.589001     TO     USA
d  0.188695 -0.758872 -0.933237  0.955057     DC     GER
e  0.190794  1.978757  2.605967  0.683509     OR     FRA

In [67]:
df.drop('states',axis=1)

          w         x         y         z country
a  2.706850  0.628133  0.907969  0.503826     IND
b  0.651118 -0.319318 -0.848077  0.605965     BRA
c -2.018168  0.740122  0.528813 -0.589001     USA
d  0.188695 -0.758872 -0.933237  0.955057     GER
e  0.190794  1.978757  2.605967  0.683509     FRA

In [68]:
df

          w         x         y         z states country
a  2.706850  0.628133  0.907969  0.503826     CA     IND
b  0.651118 -0.319318 -0.848077  0.605965     NY     BRA
c -2.018168  0.740122  0.528813 -0.589001     TO     USA
d  0.188695 -0.758872 -0.933237  0.955057     DC     GER
e  0.190794  1.978757  2.605967  0.683509     OR     FRA

In [69]:
df.set_index('states')

               w         x         y         z country
states
CA      2.706850  0.628133  0.907969  0.503826     IND
NY      0.651118 -0.319318 -0.848077  0.605965     BRA
TO     -2.018168  0.740122  0.528813 -0.589001     USA
DC      0.188695 -0.758872 -0.933237  0.955057     GER
OR      0.190794  1.978757  2.605967  0.683509     FRA

DATA FRAME 3